Table of Contents
 Class Material
Namespace
IdeaRS.OpenModel.Material
Assembly
IdeaRS.OpenModel.dll
Material base class
public abstract class Material : OpenElementId
Inheritance
object
OpenObject
OpenElementId
Material
Derived
MatConcrete
MaterialBoltGrade
MatPrestressSteel
MatReinforcement
MatSteel
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 E
Young's modulus
public double E { get; set; }
Property Value
double
 G
Shear modulus
public double G { get; set; }
Property Value
double
 IsDefaultMaterial
True if material is default material from the code
public bool IsDefaultMaterial { get; set; }
Property Value
bool
 LoadFromLibrary
Load from library - try override properties from library find material by name
public bool LoadFromLibrary { get; set; }
Property Value
bool
 Name
Name of material
public string Name { get; set; }
Property Value
string
 OrderInCode
Order of this material in the code
public int OrderInCode { get; set; }
Property Value
int
 Poisson
Poisson's ratio
public double Poisson { get; set; }
Property Value
double
 SpecificHeat
Specific heat capacity
public double SpecificHeat { get; set; }
Property Value
double
 StateOfThermalConductivity
State of thermal conductivity curvature
public ThermalConductivityState StateOfThermalConductivity { get; set; }
Property Value
ThermalConductivityState
 StateOfThermalExpansion
State of thermal expansion curvature
public ThermalExpansionState StateOfThermalExpansion { get; set; }
Property Value
ThermalExpansionState
 StateOfThermalSpecificHeat
State of thermal specific heat curvature
public ThermalSpecificHeatState StateOfThermalSpecificHeat { get; set; }
Property Value
ThermalSpecificHeatState
 StateOfThermalStrain
State of thermal strain curvature
public ThermalStrainState StateOfThermalStrain { get; set; }
Property Value
ThermalStrainState
 StateOfThermalStressStrain
State of thermal specific stress-strain curvature
public ThermalStressStrainState StateOfThermalStressStrain { get; set; }
Property Value
ThermalStressStrainState
 ThermalConductivity
Thermal conductivity
public double ThermalConductivity { get; set; }
Property Value
double
 ThermalExpansion
Thermal expansion
public double ThermalExpansion { get; set; }
Property Value
double
 UnitMass
Unit weight
public double UnitMass { get; set; }
Property Value
double
 UserThermalConductivityCurvature
User-defined curvature for thermal conductivity curvature { x = Θ[K], y = λc[W/(m K)] }
public Polygon2D UserThermalConductivityCurvature { get; set; }
Property Value
Polygon2D
 UserThermalExpansionCurvature
User-defined curvature for thermal expansion curvature { x = Θ[K], y = γ[K-1] }
public Polygon2D UserThermalExpansionCurvature { get; set; }
Property Value
Polygon2D
 UserThermalSpecificHeatCurvature
User-defined curvature for thermal specific heat { x = Θ[K], y = cp[J/(kg K)] }
public Polygon2D UserThermalSpecificHeatCurvature { get; set; }
Property Value
Polygon2D
 UserThermalStrainCurvature
User-defined curvature for thermal strain curvature { x = Θ[K], y = εc[Δl/l] }
public Polygon2D UserThermalStrainCurvature { get; set; }
Property Value
Polygon2D
 UserThermalStressStrainCurvature
User-defined curvature for thermal stress,strain { Temperature = Θ[K], {x = ε[-], y = σ[Pa]}}
public List<TemperatureCurve2D> UserThermalStressStrainCurvature { get; set; }
Property Value
List<TemperatureCurve2D>
 Edit this page